glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
//********************************************************************************
//arm_usart.c
//********************************************************************************
#include "stm32f4xx.h"
#include <stdbool.h>
#include "common.h"
#include "RTE_Device.h"
#include "RTE_Components.h"
#include "Driver_USART.h"
#include "arm_gpio.h"
#include "arm_usart.h"
#include "arm_clock.h"
#include "gpio.h"
#include "usart.h"


//********************************************************************************
//Macros
//********************************************************************************

/* History:
 *  Version 1.0
 *    - Initial release
 */
#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0)

// USART Driver flags
#define ARM_USART_FLAG_INITIALIZED       (uint16_t)(1U << 0)
#define ARM_USART_FLAG_POWERED           (uint16_t)(1U << 1)
#define ARM_USART_FLAG_CONFIGURED        (uint16_t)(1U << 2)
#define ARM_USART_FLAG_TX_ENABLED        (uint16_t)(1U << 3)
#define ARM_USART_FLAG_RX_ENABLED        (uint16_t)(1U << 4)

//********************************************************************************
//Enums
//********************************************************************************

//********************************************************************************
//Typedefs
//********************************************************************************

// ARM USART Transfer Information (Run-Time)
typedef struct {
    uint32_t                rx_num;        // Total number of data to be received
    uint32_t                tx_num;        // Total number of data to be send
    uint8_t                *p_rx_buf;      // Pointer to in data buffer
    uint8_t                *p_tx_buf;      // Pointer to out data buffer
    uint32_t                rx_cnt;        // Number of data received
    uint32_t                tx_cnt;        // Number of data sent
    uint8_t                 tx_def_val;    // Transmit default value (used in USART_SYNC_MASTER_MODE_RX)
    uint8_t                 rx_dump_val;   // Receive dump value (used in USART_SYNC_MASTER_MODE_TX)
} ARM_USART_TransferInfo_t;

// ARM USART Information (Run-Time)
typedef struct {
    ARM_USART_SignalEvent_t  cb_event;        // Event callback
    uint16_t                 flags;          // USART driver flags
    uint8_t                  mode;            // USART mode
    uint32_t                 baudrate;        // Baudrate
    ARM_USART_STATUS         xfer_status;     // USART transfer status
    ARM_USART_MODEM_STATUS   modem_status;     // USART modem status
    ARM_USART_TransferInfo_t xfer_info;       // Transfer information
} ARM_USART_Info_t;

// ARM USART Resources definitions
typedef struct {
    ARM_USART_CAPABILITIES capabilities;  // Capabilities
    ePeriphTypes           usart_name;
    USART_TypeDef          *p_reg;        // Pointer to USART peripheral registers
    USART_PinCfg_t         *p_pin;        // Pointer to USART pins configuration
    IRQn_Type              irq_num;       // USART IRQ Number
//    uint32_t                trig_lvl;      // FIFO Trigger level
//    USART_DMA              *p_dma_tx;
//    USART_DMA              *p_dma_rx;
    ARM_USART_Info_t    *p_info;          // Run-Time Information
} ARM_USART_Resources_t;

//********************************************************************************
//Variables
//********************************************************************************

// Driver Version
static const ARM_DRIVER_VERSION ARM_USART_Driver_Version =
{ ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

#if (RTE_USART1)
static ARM_USART_Resources_t ARM_USART1_Resources;
static ARM_USART_Info_t USART1_Info = {0};
#endif //(RTE_USART1)

#if (RTE_UART4)
static ARM_USART_Resources_t ARM_UART4_Resources;
static ARM_USART_Info_t UART4_Info = {0};
#endif //(RTE_UART4)

//********************************************************************************
//Prototypes
//********************************************************************************

static ARM_DRIVER_VERSION ARM_USARTx_GetVersion(void);
static ARM_USART_CAPABILITIES ARM_USART_GetCapabilities(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Initialize(ARM_USART_SignalEvent_t  cb_event,
                                    ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Uninitialize(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_PowerControl(ARM_POWER_STATE  state,
                                      ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Send(const void *data, uint32_t num, ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Receive(void *data, uint32_t num, ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Transfer(const void *data_out, void *data_in, uint32_t num, ARM_USART_Resources_t *usart);
static uint32_t ARM_USART_GetTxCount(ARM_USART_Resources_t *usart);
static uint32_t ARM_USART_GetRxCount(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Control(uint32_t control, uint32_t arg,
                                 ARM_USART_Resources_t *usart);
static int32_t ARM_USART_SetBaudrate(uint32_t arg);
static ARM_USART_STATUS ARM_USART_GetStatus(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, ARM_USART_Resources_t *usart);
static ARM_USART_MODEM_STATUS ARM_USART_GetModemStatus(ARM_USART_Resources_t *usart);
static void USART_IRQHandler(ARM_USART_Resources_t *usart);

#if (RTE_USART1)
static void ARM_USART1_Resources_Struct_Init(void);
static ARM_USART_CAPABILITIES ARM_USART1_GetCapabilities(void);
static int32_t ARM_USART1_Initialize(ARM_USART_SignalEvent_t cb_event);
static int32_t ARM_USART1_Uninitialize(void);
static int32_t ARM_USART1_PowerControl(ARM_POWER_STATE state);
static int32_t ARM_USART1_Send(const void *data, uint32_t num);
static int32_t ARM_USART1_Receive(void *data, uint32_t num);
static int32_t ARM_USART1_Transfer(const void *data_out, void *data_in, uint32_t num);
static uint32_t ARM_USART1_GetTxCount(void);
static uint32_t ARM_USART1_GetRxCount(void);
static int32_t ARM_USART1_Control(uint32_t control, uint32_t arg);;
static ARM_USART_STATUS ARM_USART1_GetStatus(void);
static int32_t ARM_USART1_SetModemControl(ARM_USART_MODEM_CONTROL control);
static ARM_USART_MODEM_STATUS ARM_USART1_GetModemStatus(void);
#endif //(RTE_USART1)

#if (RTE_UART4)
static void ARM_UART4_Resources_Struct_Init(void);
#endif //(RTE_UART4)

