glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
static int32_t ARM_USART_Send(const void *data, uint32_t num,
                              ARM_USART_Resources_t *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Receive(void *data, uint32_t num,
                                 ARM_USART_Resources_t *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Transfer(const void *data_out, void *data_in,
                                  uint32_t num, ARM_USART_Resources_t *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static uint32_t ARM_USART_GetTxCount(ARM_USART_Resources_t *usart)
{
    uint32_t cnt;
// to do
    return cnt;
}

static uint32_t ARM_USART_GetRxCount(ARM_USART_Resources_t *usart)

{
    uint32_t cnt;
// to do
    return cnt;
}

static int32_t ARM_USART_Control(uint32_t control, uint32_t arg,
                                 ARM_USART_Resources_t *usart)
{
    if((usart->p_info->flags & ARM_USART_FLAG_POWERED) == 0U) {
        // USART not powered
        return ARM_DRIVER_ERROR;
    }

// Check if Receiver/Transmitter is busy
    if((usart->p_info->xfer_status.tx_busy != 0U) ||
       (usart->p_info->xfer_status.rx_busy != 0U)) {
        return ARM_DRIVER_ERROR_BUSY;
    }
//Miscellaneous Controls
//Attention!!! - Miscellaneous Controls Operations cannot be ORed!
    switch(control & ARM_USART_CONTROL_Msk) {
        //Synchronous Receive only
        case ARM_USART_SET_DEFAULT_TX_VALUE: {
            if((usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_info->xfer_info.tx_def_val = arg;
                return ARM_DRIVER_OK;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
        //IrDA Pulse
        case ARM_USART_SET_IRDA_PULSE: {
            if(usart->p_info->mode == ARM_USART_MODE_IRDA)  {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
        //Smart Card Guard Time
        case ARM_USART_SET_SMART_CARD_GUARD_TIME: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
        //Smart Card Clock
        case ARM_USART_SET_SMART_CARD_CLOCK: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
        //Smart Card NACK generation
        case ARM_USART_CONTROL_SMART_CARD_NACK: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
        //Control TX
        case ARM_USART_CONTROL_TX: {
            if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                if(arg) {
                    if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                        ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                        GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                     ARM_GPIO_IO_MODE_OUTPUT, ARM_GPIO_IO_TYPE_PUSH_PULL ,
                                     ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                     usart-> p_pin[TX_PIN].alt_func);
                    } else {
                        ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                        GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                     ARM_GPIO_IO_MODE_OUTPUT, ARM_GPIO_IO_TYPE_OPEN_DRAIN ,
                                     ARM_GPIO_IO_PULL_UP, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                     usart-> p_pin[TX_PIN].alt_func);
                    }
                    usart->p_reg->CR1 |= USART_CR1_TE;
                    usart->p_info->flags |= ARM_USART_FLAG_TX_ENABLED;
                } else {
                    usart->p_reg->CR1 &= ~USART_CR1_TE;
                    usart->p_info->flags &= ~ARM_USART_FLAG_TX_ENABLED;
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                 0U, 0U, 0U, 0U, 0U);
                }
            }
            return ARM_DRIVER_OK;
        }

        //Control RX
        case ARM_USART_CONTROL_RX: {
            if(arg) {
                if((usart->p_info->mode != ARM_USART_MODE_SMART_CARD) &&
                   (usart->p_info->mode != ARM_USART_MODE_SINGLE_WIRE)) {
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                                 ARM_GPIO_IO_MODE_INPUT, ARM_GPIO_IO_TYPE_OPEN_DRAIN ,
                                 ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                 usart-> p_pin[RX_PIN].alt_func);
                } else {
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                                 0U, 0U, 0U, 0U, 0U);
                }
                usart->p_reg->CR1 |= USART_CR1_RE;
                usart->p_info->flags |= ARM_USART_FLAG_RX_ENABLED;
            } else {
                usart->p_reg->CR1 &= ~USART_CR1_RE;
                usart->p_info->flags &= ~ARM_USART_FLAG_RX_ENABLED;
                ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                             0U, 0U, 0U, 0U, 0U);
            }
            return ARM_DRIVER_OK;
        }

        //Control break
        case ARM_USART_CONTROL_BREAK: {
            if(arg) {
                if(usart->p_info->xfer_status.tx_busy) {
                    return ARM_DRIVER_ERROR_BUSY;
                }
                usart->p_info->xfer_status.tx_busy = 1UL;
                usart->p_reg->CR1 |= USART_CR1_SBK;
            } else {
                usart->p_reg->CR1 &= ~USART_CR1_SBK;
                usart->p_info->xfer_status.tx_busy = 0UL;
            }
            return ARM_DRIVER_OK;
        }

        //Abort Send
        case ARM_USART_ABORT_SEND: {
            //Disable TXE and TC interrupts
            usart->p_reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);
            usart->p_info->xfer_info.tx_cnt = 0UL;
            usart->p_info->xfer_status.tx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        case ARM_USART_ABORT_RECEIVE: {
            //Disable RXNE interrupt
            usart->p_reg->CR1 &= ~USART_CR1_RXNEIE;
            //Disable PE interrupt
            usart->p_reg->SR &= ~USART_SR_PE;
            //Disable FE, ORE and NF interrupts
            usart->p_reg->CR3 &= ~USART_CR3_EIE;
            usart->p_info->xfer_info.rx_cnt = 0UL;
            usart->p_info->xfer_status.rx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        case ARM_USART_ABORT_TRANSFER: {
            //Disable TXE and TC interrupts
            usart->p_reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);
            //Disable RXNE interrupt
            usart->p_reg->CR1 &= ~USART_CR1_RXNEIE;
            //Disable PE interrupt
            usart->p_reg->SR &= ~USART_SR_PE;
            //Disable FE, ORE and NF interrupts
            usart->p_reg->CR3 &= ~USART_CR3_EIE;
            usart->p_info->xfer_info.tx_cnt = 0UL;
            usart->p_info->xfer_info.rx_cnt = 0UL;
            usart->p_info->xfer_status.tx_busy = 0UL;
            usart->p_info->xfer_status.rx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        default: {
            break;
        }
    }

//USART Mode
    uint8_t mode = 0U;
    switch(control & ARM_USART_CONTROL_Msk) {
        case ARM_USART_MODE_ASYNCHRONOUS: {
            if(usart->capabilities.asynchronous) {
                mode = ARM_USART_MODE_ASYNCHRONOUS;
                if(ARM_USART_SetBaudrate(arg) == -1) {
                    return ARM_USART_ERROR_BAUDRATE;
                }
            } else {
                return ARM_USART_ERROR_MODE;
            }
            break;
        }
        case ARM_USART_MODE_SYNCHRONOUS_MASTER: {
            if(usart->capabilities.synchronous_master) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE: {
            //the mode is unsupported in STM32F407
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
        case ARM_USART_MODE_SINGLE_WIRE: {
            if(usart->capabilities.single_wire) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_IRDA: {
            if(usart->capabilities.irda) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        case ARM_USART_MODE_SMART_CARD: {
            if(usart->capabilities.smart_card) {
                //the mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_USART_ERROR_MODE;
            }
        }
        //unsupported commands
        default: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
    }

//USART Data Bits
    usart->p_reg->CR1 &= ~USART_CR1_M_Msk;
    switch(control & ARM_USART_DATA_BITS_Msk) {
        case ARM_USART_DATA_BITS_5: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_6: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_7: {
            return ARM_USART_ERROR_DATA_BITS;
        }
        case ARM_USART_DATA_BITS_8: {
            usart->p_reg->CR1 &= ~USART_CR1_M;
            break;
        }
        case ARM_USART_DATA_BITS_9: {
            usart->p_reg->CR1 |= USART_CR1_M;
            break;
        }
        default: {
            return ARM_USART_ERROR_DATA_BITS;
        }
    }

//USART Parity
    usart->p_reg->CR1 &= ~USART_CR1_PCE_Msk;
    usart->p_reg->CR1 &= ~USART_CR1_PS_Msk;
    switch(control & ARM_USART_PARITY_Msk) {
        case ARM_USART_PARITY_NONE: {
            usart->p_reg->CR1 &= ~USART_CR1_PCE;
            break;
        }
        case ARM_USART_PARITY_EVEN: {
            usart->p_reg->CR1 |= USART_CR1_PCE;
            usart->p_reg->CR1 &= ~USART_CR1_PS;
            break;
        }
        case ARM_USART_PARITY_ODD: {
            usart->p_reg->CR1 |= USART_CR1_PCE;
            usart->p_reg->CR1 |= USART_CR1_PS;
            break;
        }
        default: {
            return ARM_USART_ERROR_PARITY;
        }
    }

