glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
//USART Stop Bits
    usart->p_reg->CR2 &= ~USART_CR2_STOP_Msk;
    switch(control & ARM_USART_STOP_BITS_Msk) {
        case ARM_USART_STOP_BITS_1: {
            usart->p_reg->CR2 &= ~(USART_CR2_STOP_0 | USART_CR2_STOP_1);
            break;
        }
        case ARM_USART_STOP_BITS_2: {
            usart->p_reg->CR2 &= ~USART_CR2_STOP_0;
            usart->p_reg->CR2 |= USART_CR2_STOP_1;
            break;
        }
        case ARM_USART_STOP_BITS_1_5: {
            usart->p_reg->CR2 |= (USART_CR2_STOP_0 | USART_CR2_STOP_1);
            break;
        }
        case ARM_USART_STOP_BITS_0_5: {
            usart->p_reg->CR2 |= USART_CR2_STOP_0;
            usart->p_reg->CR2 &= ~USART_CR2_STOP_1;
            break;
        }
        default: {
            return ARM_USART_ERROR_STOP_BITS;
        }
    }

//USART Flow Control
    usart->p_reg->CR3 &= ~(USART_CR3_RTSE_Msk | USART_CR3_CTSE_Msk);
    switch(control & ARM_USART_FLOW_CONTROL_Msk) {
        case ARM_USART_FLOW_CONTROL_NONE: {
            break;
        }
        case ARM_USART_FLOW_CONTROL_RTS: {
            if(usart->capabilities.flow_control_rts) {
                usart->p_reg->CR3 |= USART_CR3_RTSE;
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        case ARM_USART_FLOW_CONTROL_CTS: {
            if(usart->capabilities.flow_control_cts) {
                usart->p_reg->CR3 |= USART_CR3_CTSE;
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        case ARM_USART_FLOW_CONTROL_RTS_CTS: {
            if(usart->capabilities.flow_control_rts &&
               usart->capabilities.flow_control_cts) {
                usart->p_reg->CR3 |= (USART_CR3_RTSE | USART_CR3_CTSE);
            } else {
                return ARM_USART_ERROR_FLOW_CONTROL;
            }
            break;
        }
        default: {
            return ARM_USART_ERROR_FLOW_CONTROL;
        }
    }

// Clock setting for synchronous mode
//USART Clock Polarity (Synchronous mode)
    usart->p_reg->CR2 &= ~(USART_CR2_CPOL_Msk);
    switch(control & ARM_USART_CPOL_Msk) {
        case ARM_USART_CPOL0:
            if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_reg->CR2 &= ~(USART_CR2_CPOL);
                break;
            } else {
                return ARM_USART_ERROR_CPOL;
            }
        case ARM_USART_CPOL1: {
            if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_reg->CR2 |= USART_CR2_CPOL;
                break;
            } else {
                return ARM_USART_ERROR_CPOL;
            }
        }
        default: {
            return ARM_USART_ERROR_CPOL;
        }
    }

//USART Clock Phase (Synchronous mode)
    usart->p_reg->CR2 &= ~(USART_CR2_CPHA_Msk);
    switch(control & ARM_USART_CPHA_Msk) {
        case ARM_USART_CPHA0:
            if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_reg->CR2 &= ~(USART_CR2_CPHA);
                break;
            } else {
                return ARM_USART_ERROR_CPHA;
            }
        case ARM_USART_CPHA1: {
            if((mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_reg->CR2 |= USART_CR2_CPHA;
                break;
            } else {
                return ARM_USART_ERROR_CPHA;
            }
        }
        default: {
            return ARM_USART_ERROR_CPHA;
        }
    }

// Configuration is successful - mode id valid
    usart->p_info->mode = mode;

// Set configured flag
    usart->p_info->flags |= ARM_USART_FLAG_CONFIGURED;
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_SetBaudrate(uint32_t arg)
{
    //to do
    return 0;
}

static ARM_USART_STATUS ARM_USART_GetStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_STATUS status;
    status.tx_busy = usart->p_info->xfer_status.tx_busy; //Transmitter busy flag
    status.rx_busy = usart->p_info->xfer_status.rx_busy; //Receiver busy flag
    status.tx_underflow = usart->p_info->xfer_status.tx_underflow; //Transmit data underflow detected (cleared on start of next send operation)
    status.rx_overflow = usart->p_info->xfer_status.rx_overflow; //Receive data overflow detected (cleared on start of next receive operation)
    status.rx_break = usart->p_info->xfer_status.rx_break; //Break detected on receive (cleared on start of next receive operation)
    status.rx_framing_error = usart->p_info->xfer_status.rx_framing_error; //Framing error detected on receive (cleared on start of next receive operation)
    status.rx_parity_error = usart->p_info->xfer_status.rx_parity_error; //Parity error detected on receive (cleared on start of next receive operation)
    status.reserved = usart->p_info->xfer_status.reserved;
    return status;
}

static int32_t ARM_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, ARM_USART_Resources_t *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static ARM_USART_MODEM_STATUS ARM_USART_GetModemStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_MODEM_STATUS status;
    status.cts = usart->p_info->modem_status.cts; //CTS state: 1=Active, 0=Inactive
    status.dsr = usart->p_info->modem_status.dsr; //DSR state: 1=Active, 0=Inactive
    status.dcd = usart->p_info->modem_status.dcd; //DCD state: 1=Active, 0=Inactive
    status.ri = usart->p_info->modem_status.ri; //RI  state: 1=Active, 0=Inactive
    status.reserved = usart->p_info->modem_status.reserved;
    return status;
}

static void USART_IRQHandler(ARM_USART_Resources_t *usart)
{
//to do
}

/*************************************************
Driver capabilities of USART2, USART3, USART6 are completely
similar to USART1 driver capabilities.
***************************************************/
#if (RTE_USART1)

static void ARM_USART1_Resources_Struct_Init(void)
{
    ARM_USART_Resources_t *p_str = &ARM_USART1_Resources;
    p_str->capabilities.asynchronous = 1;               // supports UART (Asynchronous) mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.synchronous_master = 1;         // supports Synchronous Master mode
#else
    p_str->capabilities.synchronous_master = 0;         // supports Synchronous Master mode
#endif //(RTE_USART1_CK_ID > 0)

    p_str->capabilities.synchronous_slave = 0;          // supports Synchronous Slave mode
    p_str->capabilities.single_wire = 1;                // supports UART Single-wire mode
    p_str->capabilities.irda = 1;                       // supports UART IrDA mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.smart_card =  1;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  1;          // Smart Card Clock generator available
#else
    p_str->capabilities.smart_card =  0;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  0;          // Smart Card Clock generator available
#endif //(RTE_USART1_CK_ID > 0)

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.flow_control_rts =  1;          // RTS Flow Control available
#else
    p_str->capabilities.flow_control_rts =  0;          // RTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0) 

#if RTE_USART1_CTS_ID > 0
    p_str->capabilities.flow_control_cts =  1;          // CTS Flow Control available
#else
    p_str->capabilities.flow_control_cts =  0;          // CTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0)               

    p_str->capabilities.event_tx_complete =  1;         // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    p_str->capabilities.event_rx_timeout =  0;          // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.rts =  1;                       // RTS Line: 0=not available, 1=available
#else
    p_str->capabilities.rts =  0;                       // RTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0) 

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.cts =  1;                       // CTS Line: 0=not available, 1=available
#else
    p_str->capabilities.cts =  0;                       // CTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0)       

    p_str->capabilities.dtr =  0;                       // DTR Line: 0=not available, 1=available
    p_str->capabilities.dsr =  0;                       // DSR Line: 0=not available, 1=available
    p_str->capabilities.dcd =  0;                       // DCD Line: 0=not available, 1=available
    p_str->capabilities.ri =  0;                        // RI Line: 0=not available, 1=available

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.event_cts = 1;                  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    p_str->capabilities.event_cts =  0;                 // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif //(RTE_USART1_CTS_ID > 0) 

    p_str->capabilities.event_dsr =  0;                 // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    p_str->capabilities.event_dcd =  0;                 // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    p_str->capabilities.event_ri =  0;                  // Signal RI change event: \ref ARM_USART_EVENT_RI
    p_str->capabilities.reserved =  0;                  // Reserved (must be zero)
    p_str->usart_name = USART_1;                        //Interface name
    p_str->p_reg = USART1;                              // Pointer to USART peripheral registers
    p_str->p_pin = USART_GetPinCfg(USART_1);         // Pointer to USART pins configuration
    p_str->irq_num = USART1_IRQn;
    p_str->p_info = &USART1_Info;
}

